export const localizationRu = {
	registrationPage: {
		title: 'Регистрация',
		subtitle: 'Пожалуйста зарегистрируйтесь, чтобы продолжить.',
		account: 'Уже есть аккаунт?',
		signUp: 'Зарегистрироваться',
	},
	loginPage: {
		title: 'Вход',
		subtitle: 'Пожалуйста войдите, чтобы продолжить.',
		account: 'Нет аккаунта?',
		signIn: 'Войти',
	},
	bottomMenu: {
		stats: 'Статистика',
		health: 'Здоровье',
		achievements: 'Достижения',
	},
	common: {
		send: 'Отправить',
	},
	auth: {
		name: 'Имя',
		password: 'Пароль',
		login: 'Логин',
	},
	resetTimerButton: {
		title: 'Сорвался?',
		subtitle: 'Сбросить прогресс',
	},
	resetTimerDialog: {
		title: 'Вы действительно хотите сбросить прогресс?',
		description: [
			`Каждый успех складывается из времени, терпения и упорства. Рецидивы – это не неудачи, а лишь временные шаги назад на пути к своим целям. Главное – не останавливаться и двигаться вперед.`,
			`Прогресс – это не прямая линия, а путь с подъемами и спусками. Рецидивы – это всего лишь препятствия на твоем пути к переменам. Не бойся их, а преодолевай и иди дальше.`,
			`Каждый день новая возможность сделать правильный выбор. Если ты допустил рецидив, не бросай все и не сдавайся. Начни сегодня с чистого листа и иди к своей цели шаг за шагом.`,
			`Важно помнить, что даже после рецидива у тебя остается выбор: продолжать идти вперед или вернуться назад. Ты владелец своей судьбы, и только ты решаешь, какой путь выбрать.`,
			`Рецидивы – это не повод отказываться от своих мечтаний. Вместо того чтобы расстраиваться, используй их как уроки на пути к успеху. Каждый новый день дает шанс начать с чистого листа и продолжить двигаться вперед.`,
			`Не забывай, что даже в самых темных моментах рецидивы – это лишь временный перерыв в твоем стремлении. Продолжай двигаться вперед, и каждый новый день станет шагом к победе над зависимостью.`,
			`Великие истории успеха всегда включают в себя времена испытаний и слабостей. Рецидив – это не конец истории, а лишь одна из глав, которая делает твой путь к победе более вдохновляющим.`,
			`«Неудачи – это возможности начать снова, но уже более мудро.» – Генри Форд`,
			`«Сильнее всего тот, кто умеет владеть собой.» – Лев Толстой`,
			`«Успех – это способность идти от поражения к поражению без потери энтузиазма.» – Уинстон Черчилль`,
			`«Подлинная сила заключается в сдерживании себя, а не в контролировании других.» – Лао-Цзы`,
			`«Всякий раз, когда ты думаешь о том, чтобы сдаться, вспомни, зачем ты начинал.» – Твой разум`,
		],
		accept: 'Сбросить',
		reject: 'Закрыть окно',
	},
	resetTimerAlert: {
		msg: 'Таймер успешно обновлён',
	},
	yup: {
		passwordLength: 'Минимум 8 символов',
		requiredField: 'Обязательное поле',
	},
}
